Repository: Bernardo-f/Care4Plant-App
Catalog: app/lib/l10n/app_*.arb
Languages: cy, es

source: Log in
cy: Mewngofnodi
es: Iniciar sesión

source: Sign up
cy: Cofrestru
es: Registrarme

# notAccount
source: Do not have an account?
cy: Nid oes gennych gyfrif?
es: No tienes una cuenta?

# alreadyAccount
source: Already have an account?
cy: Oes gennych chi Gyfrif yn barod?
es: Ya tienes una cuenta?

# email
source: Set up an email
cy: Sefydlu e-bost
es: Ingrese el correo

# name
source: Set up a name
cy: Gosodwch enw
es: Ingrese su nombre

# password
source: Set up a password
cy: Sefydlu cyfrinair
es: Ingrese la contraseña

source: Repeat password
cy: Ailadrodd cyfrinair
es: Repita la contraseña

# orLogin
source: or login with
cy: neu fewngofnodi gyda
es: o inicie sesión con

# orSignup
source: or sign up with
cy: neu gofrestru gyda
es: o registrese con

source: Required field
cy: Maes gofynnol
es: Campo requerido

# passwordMatch
source: Password does not match
cy: Nid yw'r cyfrinair yn cyd-fynd
es: La contraseña no coincide

# nameLength
source: The name has a maximum of 50 characters
cy: Mae gan yr enw uchafswm o 50 nod
es: El nombre tiene 50 caracteres como máximo

# passwordLength
source: The password must be at least 8 characters long
cy: Rhaid i'r cyfrinair fod o leiaf 8 nod o hyd
es: La contraseña debe tener como mínimo un largo de 8 carácteres

# passwordCharacters
source: The password must contain at least one lowercase letter, one uppercase letter, and one number
cy: Rhaid i'r cyfrinair gynnwys o leiaf un llythyren fach, un briflythyren, ac un rhif
es: La contraseña debe contener al menos una minúscula, una mayúscula y un número

# emailFormat
source: Enter a valid email
cy: Nodwch ebost dilys
es: Ingrese un email válido

# onboardingTittle1
source: Identify your stress level through 'careYOU'
cy: Nodwch lefel eich straen drwy 'careYOU'
es: IDENTIFICA TU NIVEL DE ESTRÉS A TRAVÉS DE 'CAREYOU'

# onboardingTittle2
source: Get your own plant & take care of it!
cy: Ewch i gael eich planhigyn eich hun a gofalu amdano!
es: ¡CONSIGUE TU PROPIA PLANTA Y CUÍDALA!

# onboardingTittle3
source: Take care of yourself to take care of them
cy: Gofalwch amdanoch eich hun er mwyn gofalu amdanyn nhw
es: CUÍDATE PARA CUIDAR DE ELLOS

# onboardingTittle4
source: Explore the Greenhouse
cy: Archwilio'r Tŷ Gwydr
es: EXPLORA EL INVERNADERO

# onboardingSubTittle1
source: Taking the care burden test to identify your stress levels
cy: Gwneud y prawf baich gofal er mwyn deall eich lefelau straen
es: Responde el test de sobrecarga para conocer tu nivel de estrés

# onboardingSubTittle2
source: Your plant represent you mental and emotional self
cy: Mae eich planhigyn yn eich cynrychioli chi yn feddyliol ac emosiynol
es: Tu planta ayuda a representar tu bienestar emocional y mental

# onboardingSubTittle3
source: By completing mood improvement activities you will be taken care of your plant
cy: Drwy gwblhau gweithgareddau gwella hwyliau byddwch yn gofalu am eich planhigyn
es: Realiza las actividades para mejorar tu estado de ánimo y cuidarás de tu planta

# onboardingSubTittle4
source: Greenhouse is a community where you can find other caregivers
cy: Mae'r Tŷ Gwydr yn gymuned lle gallwch ddod o hyd i ofalwyr eraill
es: El 'Invernadero' es una comunidad donde puedes encontrar otros cuidadores.

# onboardingText1
source: Taking the questionnaire to know your mental wellbeing better
cy: Gwneud yr holiadur er mwyn deall eich lles meddyliol yn well

# onboardingText2
source: Having your own plant and you should take care of them in the way you take care of yourself
cy: Cael eich planhigyn eich hun a dylech ofalu amdanyn nhw yn y ffordd rydych chi'n gofalu amdanoch chi eich hun
es: Selecciona tu planta y cuídala como te cuidarías a tí mismo

# onboardingText3
source: We have suggested some activities according to your mood, you can also explore other activities
cy: Rydyn ni wedi awgrymu rhai gweithgareddau i gyd-fynd â'ch hwyliau, gallwch hefyd bori drwy weithgareddau eraill
es: Hemos sugerido actividades de acuerdo a tu estado de ánimo, también puedes explorar otras actividades

# onboardingText4
source: Remember that you are not alone! In this virtual zone you can meet other caregivers
cy: Cofiwch nad ydych chi ar eich pen eich hun! Yn y parth rhithwir hwn gallwch gwrdd â gofalwyr eraill
es: En esta zona virtual puedes conocer otros cuidadores, recuerda que no estás solo/a

# nextButtton
source: NEXT
cy: NESAF
es: SIGUIENTE

source: Skip Tour
cy: Taith Hepgor
es: Saltar Introducción

source: BASIC SETTING
cy: GOSODIAD SYLFAENOL
es: CONFIGURACIÓN BÁSICA

# settingPlantTittle
source: BEFORE START CHOOSE YOUR PLANT
cy: CYN I CHI DDECHRAU DEWISWCH EICH PLANED
es: ANTES DE COMENZAR ESCOGE TU PLANTA

# settingPreferenceTittle
source: PREFERENCE SETTING
cy: GOSOD RHAGORIAETH
es: CONFIGURACIÓN DE PREFERENCIAS

# settingPrivacyTittle
source: PRIVACY SETTING
cy: GOSOD PREIFATRWYDD
es: CONFIGURACIÓN DE PRIVACIDAD

# settingPlantSubTittle
source: Choose the plant you like!
cy: Dewiswch y planhigyn rydych chi'n ei hoffi!
es: ¡Escoge el que más te guste! él o ella será tu planta!

# settingFrecuencySubTittle
source: How often would you like to report your stress level?
cy: Pa mor aml hoffech chi roi gwybod am eich lefel straen?
es: ¿Con qué frecuencia te gustaría reportar tu nivel de estrés?

# settingNotificationSubTittle
source: Would you like to receive notifications?
cy: Hoffech chi dderbyn hysbysiadau?
es: ¿Quieres recibir notificaciones?

# settingPrivacySubTittle
source: Would you like to share your plant in the Greenhouse community?
cy: Hoffech chi rannu'ch planhigyn yn y gymuned Tŷ Gwydr?
es: ¿Te gustaría compartir tu planta en la comunidad del Invernadero?

# confirmButton
source: CONFIRM
cy: CADARNHAU
es: CONFIRMAR

# getStartedButton
source: GET STARTED
cy: DECHRAU
es: COMENZAR

# onceWeek
source: ONCE A WEEK
cy: UNWAITH YR WYTHNOS
es: UNA VEZ POR SEMANA

# twiceWeek
source: TWICE A WEEK
cy: DWYWAITH YR WYTHNOS
es: DOS VECES POR SEMANA

# onceTwoWeek
source: ONCE EVERY TWO WEEK
cy: UNWAITH BOB WYTHNOS
es: UNA VEZ CADA DOS SEMANAS

# userCenterOnceWeek
source: Once a week
cy: Unwaith yr wythnos
es: Una vez por semana

# userCenterTwiceWeek
source: Twice a week
cy: Dwywaith yr wythnos
es: Dos veces por semana

# userCenterOnceTwoWeek
source: Once every two week
cy: Unwaith bob pythefnos
es: Una vez cada dos semanas

# forStressLevel
source: For stress level test:
cy: Ar gyfer prawf lefel straen:
es: Para cuestionario de sobrecarga

# forActivities
source: For recommended activities:
cy: Ar gyfer gweithgareddau a argymhellir:
es: Para actividades recomendadas

# sharePlant
source: Share your plant with others:
cy: Rhannwch eich planhigyn gydag eraill:
es: Compartir tu planta en el Invernadero

# yesOption
source: YES
cy: OES
es: SI

# noOption
source: NO
cy: RHIF

source: Back
cy: CEFN
es: Atrás

# validateSettings
source: Missing configurations to select
cy: Ffurfweddau coll i'w dewis
es: Faltan configuraciones por seleccionar

# firstTestMessage
source: Before we start, let's take the first stress level test! It will help us get to know you better! It won't take you more than 10 minutes.
cy: Cyn dechrau, gadewch i ni sefyll y prawf lefel straen cyntaf! Bydd hyn yn ein helpu i ddod i'ch adnabod chi'n well! Wnaiff hwn ddim cymryd mwy na 10 munud i chi.
es: Para conocerte mejor y ayudarte necesitamos respondas las siguientes preguntas y nos indíques tu nivel de estrés. Esto no demorará mas de 2 minutos.

# postFirstTestMessage
source: Congratulations! now it is time to explore Care4plant
cy: Llongyfarchiadau! nawr mae'n bryd archwilio Care4plant
es: Felicidades, ahora puedes explorar Care4Plant

# welcome
source: WELCOME TO CARE4PLANT
cy: CROESO I CARE4PLANT
es: BIENVENIDO A CARE4PLANT

# testTitle
source: Stress level test
cy: Prawf lefel straen
es: Prueba de nivel de estrés

# testSubTitle
source: EMOTION WELLBEING
cy: LLES EMOSIWN
es: BIENESTAR EMOCIONAL

# question1
source: Do you feel that because of the time you spend with your relative you don’t have enough time for yourself?
cy: Ydych chi'n teimlo, oherwydd yr amser rydych chi'n ei dreulio gyda'ch perthynas, nad oes gennych chi ddigon o amser i chi eich hun?
es: ¿Piensas que debido al tiempo que dedicas a tu familiar no tienes suficiente tiempo para ti?

# question2
source: Do you feel embarrassed about your relative’s behaviour?
cy: Ydych chi'n teimlo embaras oherwydd ymddygiad eich perthynas?
es: ¿Sientes vergüenza por la conducta de tu familiar?

# question3
source: Do you feel angry towards your relative when you are around him/her?
cy: Ydych chi'n teimlo'n ddig tuag at eich perthynas pan fyddwch chi yn eu cwmni?
es: ¿Te sientes enfadado/a cuando estás cerca de tu familiar?

# question4
source: Do you feel strained when you are around your relative?
cy: Ydych chi'n teimlo dan straen pan fyddwch chi yng nghwmni eich perthynas?
es: ¿Te sientes tenso/a cuando está cerca de tu familiar?

# question5
source: Do you feel your health has suffered because of your involvement with your relative?
cy: Ydych chi'n teimlo bod eich iechyd wedi dioddef oherwydd eich cysylltiad â'ch perthynas?
es: ¿Piensas que tu salud ha empeorado debido a tener que cuidar a tu familiar?

# question6
source: Do you feel you could do a better job in caring for your relative?
cy: Ydych chi'n teimlo y gallech chi wneud yn well wrth ofalu am eich perthynas?
es: ¿Piensas que podrías cuidar mejor a tu familiar?

# answerOption1
source: Never
cy: Byth
es: Nunca

# answerOption2
source: Rarely
cy: Yn anaml
es: Casi nunca

# answerOption3
source: Sometimes
cy: Weithiau
es: A veces

# answerOption4
source: Quite Frequently
cy: Yn eithaf aml
es: Con bastante frecuencia

# answerOption5
source: Nearly Always
cy: Bron bob amser
es: Casi siempre

source: Log out
cy: Allgofnodi
es: Cerrar sesión

# goodMorningMessage
source: Good morning {nombre}. We wish you have a good day!
cy: Bore da {nombre}. “Dymunwn ddiwrnod da i chi!
es: Buenos días {nombre}. Te deseamos que tengas un buen día!

# userCenterTitle
source: User center
cy: Canolfan defnyddwyr
es: Centro de usuario

# careCenterTitle
source: Care Center
cy: Canolfan Gofal
es: Centro de cuidados

# greenhouseTitle
source: Welcome to the Greenhouse!
cy: Croeso i'r Tŷ Gwydr!
es: ¡Bienvenido al Invernadero!

# preferencesUserCenter
source: Preferences
cy: Dewisiadau
es: Preferencias

# privacyUserCenter
source: Privacy
cy: Preifatrwydd
es: Privacidad

# notificationsUserCenter
source: Notifications
cy: Hysbysiadau
es: Notificaciones

# dailyMoodTitle
source: How are you feeling today?
cy: Sut ydych chi'n teimlo heddiw?
es: ¿Cómo te sientes hoy?

# dailyMoodSubTitle
source: Go to the daily mood check-in
cy: Ewch i'r gwiriad hwyliau dyddiol
es: Ir al registro de estado de ánimo diario

# stressTestMessageTitle
source: Do you want to know your stress level?
cy: Hoffech chi wybod lefel eich straen?
es: ¿Quieres conocer tu nivel de estrés?

# stressTestMessageSubTitle
source: Go to stress level test
cy: Ewch i'r prawf lefel straen
es: Ir a la prueba de nivel de estrés

# takeTestMessage
source: Let's take the test
cy: Gadewch i ni sefyll y prawf
es: Vamos a realizar el test

# feelingGreat
source: great
cy: gwych
es: excelente

# feelingGood
source: good
cy: dda
es: bien

# feelingOkay
source: okay
cy: iawn
es: neutro

# feelingBad
source: bad
cy: drwg
es: mal

# feelingAwful
source: awful
cy: ofnadwy
es: horrible

source: Explore more...
cy: Pori drwy fwy o weithgareddau
es: Explora más...

# userCenterFrecuency
source: How often do you want to report your stress level:
cy: Pa mor aml ydych chi am roi gwybod eich lefel straen:
es: Frecuencia con la que quieres reportar tu nivel de estrés:

source: Recommended for you
cy: Argymhellir i chi
es: Recomendado para ti

# recommenedePath
source: Recommended path for you
cy: Llwybr a argymhellir i chi
es: Ruta recomendada para ti

source: To do
cy: Gwneud
es: Por hacer

source: Well done!
cy: Da iawn!
es: ¡Bien hecho!

# toExplore
source: To explore more activities >
cy: I bori drwy fwy o weithgareddau >
es: Para explorar más actividades >

# messageReward
source: Congratulations! You are rewarded with a chance to {accion} your plant!
cy: Llongyfarchiadau! Eich gwobr yw cyfle i {accion} eich planhigyn!
es: ¡Felicidades! Tienes una recompensa y puedes {accion} tu planta!

# useReward
source: {accion} now
cy: {accion} nawr
es: {accion} ahora

# useLater
source: Thanks, later
cy: Diolch, nes ymlaen
es: Gracias, luego

# minimunStressLevel
source: You already have the minimum level of stress
cy: Mae gennych chi'r lefel isaf o straen eisoes
es: Ya tienes el nivel mínimo de estrés

# noAccesoInvernadero
source: You do not have access to the Greenhouse, you can change this option in the 'Privacy' section in the user center.
cy: Does gennych chi ddim mynediad at y Tŷ Gwydr, gallwch newid yr opsiwn hwn yn yr adran 'Preifatrwydd' yn y ganolfan defnyddwyr.
es: No tienes acceso al Invernadero, puedes cambiar esta opción en la sección 'Privacidad' en el centro de usuario.

# messageGreenhouse
source: Share, encourage and visit other caregivers out there!
cy: Rhannwch, anogwch ac ewch i ymweld â gofalwyr eraill allan yna!
es: ¡Comparte, anima y visita a otros cuidadores!

# inputGreenhouse
source: Write down some thoughts ..
cy: Nodwch ychydig o syniadau ..
es: deja algunos pensamientos ..

# textButtonGreenhouse
source: POST
cy: SWYDD
es: ENVIAR

# thoughtsSave
source: Thought saved correctly, you can review your thoughts by tapping your plant.
cy: Syniadau wedi'u cadw'n gywir, gallwch edrych ar eich syniadau drwy dapio'ch planhigyn.
es: Pensamiento guardado correctamente, puedes revisar tus pensamientos tocando tu planta.

# welcomeMessageGreenhouse
source: Welcome to {name} Zone
cy: Croeso i Parth {name}
es: Bienvenido a la Zona de {name}

# dateToday
source: Today
cy: Heddiw
es: Hoy

# noMoreResults
source: There are no results left to display :(
cy: Does dim canlyniadau ar ôl i'w dangos :(
es: No quedan resultados para mostrar :(

# validateTest
source: Missing questions to answer
cy: Cwestiynau coll i'w hateb
es: Faltan preguntas por responder

# requestPermissions
source: You need to enable notifications in 'Settings', tap here to go to Settings
cy: Mae angen i chi alluogi hysbysiadau yn 'Gosodiadau', tapiwch yma i fynd i Gosodiadau
es: Necesitas habilitar las notificaciones en ajustes, selecciona aquí para ir a ajustes

# titleNotificationActivities
source: Your plant needs you!
cy: Mae eich planhigyn eich angen chi!
es: ¡Tu planta te necesita!

# bodyNotificationActivities
source: Enter Care4plant to carry out activities to obtain rewards and help your plant.
cy: Ewch i Care4plant i wneud gweithgareddau i ennill gwobrau a helpu'ch planhigyn.
es: Entra a Care4plant a realizar actividades para obtener recompensas y ayudar a tu planta.

# titleNotificationTest
source: The option to measure your stress level is available
cy: Mae'r opsiwn i fesur lefel eich straen ar gael
es: Tienes disponible la opción de medir tu nivel de estrés

# bodyNotificationTest
source: The option to answer the questionnaire is available.
cy: Mae'r opsiwn i ateb yr holiadur ar gael.
es: Ya tienes disponible la opción para poder responder el cuestionario nuevamente.

# errorResponse
source: An error occurred, please try again later
cy: Digwyddodd nam, rhowch gynnig arall arni yn nes ymlaen
es: Ocurrió un error, inténtelo mas tarde

# introMessageGreenhouse
source: Welcome to the Greenhouse! The Greenhouse is a community where you can connect with other caregivers. · To see the caregiver's name, press the plant once. · To enter the caregiver zone, press the plant twice.
cy: Croeso i'r Tŷ Gwydr! Mae'r Tŷ Gwydr yn gymuned lle gallwch gysylltu gyda gofalwyr eraill I weld enw'r gofalwr, pwyswch y planhigyn unwaith. · I fynd i mewn i barth y gofalwyr, pwyswch y planhigyn ddwywaith.
es: ¡Bienvenido al Invernadero! El Invernadero es una comunidad donde puedes conectar con otros cuidadores. · Para ver el nombre del cuidador, presiona una vez la planta. · Para entrar a zona del cuidador, presiona dos veces la planta.

# closeMessage
source: Close
cy: Cau
es: Cerrar

# closeAndNotShowAgain
source: Do not show this message again
cy: Peidiwch â dangos y neges hon eto
es: No volver a mostrar este mensaje

# severError
source: Server error, please try again later
es: Error en el servidor, inténtelo más tarde
